Tekla Open API Reference for Tekla Structures 2025
RebarLapping Class
 The RebarLapping class represents the lapping of reinforcing bars at a RebarSplitter.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.RebarLapping
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class RebarLapping
<SerializableAttribute>
Public Class RebarLapping
The RebarLapping type exposes the following members.
Constructors
Name | Description
RebarLapping
 Initializes a new instance of the RebarLapping class.
Top
Properties
Name | Description
LapLength
 Gets or sets the lap length. Negative values will define a gap rather than a lap.
LappingType
 Gets or sets the lapping type.
LapPlacement
 Gets or sets the placement of the lap relative to the associated RebarLegFace.
LapSide
 Gets or sets the side of the split that the lap is located.
Top
See Also
Reference
Tekla.Structures.Model Namespace